eisup_2019_docmng_integration/src/AccumulationRegisters/РасчетыПоСтраховымВзносам/РасчетыПоСтраховымВзносам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыПоСтраховымВзносам</name>
  <resources>
    <name>ПФРСтраховая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНакопительная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФССНесчастныеСлучаи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРПоДополнительномуТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНаДоплатуКПенсииШахтерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <comment>Это может быть как головная организация, так и обособленное подразделение</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ВидыПлатежейВГосБюджет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыПлатежейВГосБюджет/ВидыПлатежейВГосБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПлатежейВГосБюджет</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Налог</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НалогСам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НалогАкт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Штраф</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованию</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПениСам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПениАкт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоИзФонда</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>абс_НалогСводно</name>
  </enumValues>
  <enumValues>
    <name>абс_НалогУсловно</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ttk_НалогиЗаРубежом</name>
  </enumValues>
  <enumValues>
    <name>ttk_Проценты</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/AccumulationRegisters/РасчетыПоСтраховымВзносам/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДанных Из ЭтотОбъект Цикл
		Если (СтрокаДанных.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогАкт Или СтрокаДанных.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогСам)
			И СтрокаДанных.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			// месяц не меняем
		Иначе	
			СтрокаДанных.МесяцРасчетногоПериода = НачалоГода(СтрокаДанных.МесяцРасчетногоПериода);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
